#!/usr/bin/env python3

REACTS = {
    'emacs': 'ایمکس یه ادیتور خیلی خوبه ولی طول میکشه تا یاد بگیرید!',
    'vim': 'پیشنهاد میشه بلد باشید، یه روز ممکنه کارتون به سرور ها بخوره و لازم شه یادش بگیرید',
    'editor':'ادیتورها مختلفی هست، از پایچارم و ایمکس و ویم گرفته  تا سابلایم و اتم و ویژوال کد ادیتور. باید بررسی کنید و بر اساس علاقمندیتون یکی رو انتخاب کنید',
    'pycharm':'پایچارم به جرات می‌تونم بگم از بهترین‌هاست، با این حال باید پولش رو بدین یا از نسخه کامیونیتیش که رایگانه استفاده کنید',
    'crack':'فکر نمی‌کنم در اینجا کسی شما رو در مورد کرک‌کردن و امثالهم کمک کنه',
    'flask': 'فلسک یه فریم‌ورک کوچیک برای وب هستش که خودتون همه چیز رو روی هم سوار میکنید با دانش و نظر و طراحی خودتون. جنگو اما طراحی و نحوه ساخت رو انفورس میکنه',
    'django': 'جنگو یه فریم‌ورک خیلی عالی و سریع برای طراحی صفحات وب هستش. پروژه های بزرگ و معروفی هم توسط جنگو ساخته شده',
    'flaskvsdjango': 'این دوتا اصلا قابل مقایسه نیستن. جنگو ام‌وی‌سی رو انفورس میکنه در طراحی، ولی فلسک نه. به صورت کلی، پیشنهاد میکنم که از فلسک برای اپلیکیشن های خیلی کوچیک یا خیلی بزرگ که جزئیات کار کردنش براتون مهمه که خودتون بسازید استفاده کنید.',
    'pythonvsphp': 'اینها هردو تولز هستن و نمیشه مقایسشون کرد. هر دو باهاشون پروژه های خفنی پیاده شده. با توجه به تیمتون و تسلطشون به استک پایتون یا پی‌اچ‌پی انتخاب کنید.',
    'ubuntu': 'اوبونتو پیشنهاد خیلی خوبی برای ورود به دنیای گنو/لینوکس و برنامه نویسی هستش. هم سریع و راحته، هم جامعه کاربری بسیار مناسبی پشتش هست',
    'android': 'برای اندروید فقط در سطح ساخت بک‌اند یا سمت سرور اندروید میشه حساب باز کرد و مشخصا پایتون هیچ ادعایی و حرفی برای گفتن در حوزه اندروید و اپلیکیشن اندرویدی نداره. بهترین کار این هستش که از زبان‌های اختصاصی اندروید برای اینکار استفاده کنید',
    'python': 'پایتون یه زبان همه فن‌حریف هستش که از وب و هوش مصنوعی و شبکه گرفته تا امنیت و اینترنت اشیا و خلاصه هرچیزی فکرش رو بکنید کاربرد داره',
    'dunders': 'داندر فانکشن‌ها، یه سری توابع هستن که شما میتونید با پیاده سازیشون، عملکرد کلاسهاتون برای برخی توابع از پیش تعیین شده مثل جمع و تفریق و غیره رو اصلاح کنید.',
}
